# BasisZ Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
XYZ..::..BasisZ Property
XYZ Class See Also
---
The basis of the Z axis.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static XYZ BasisZ { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BasisZ As XYZ
	Get
```

Visual C++
---
```text
public:
static property XYZ^ BasisZ {
	XYZ^ get ();
}
```

# Remarks
The basis of the Z axis is the vector (0,0,1), the unit vector on the Z axis.
# See Also
XYZ Class
Autodesk.Revit.DB Namespace